const dialogueTree = [
    {
        orbContext: [
            {
                text:"Hey Ελενα..."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Ξύπνησες ή ακόμα λαγοκοιμάσαι;\n Έτοιμη για μερικές ερωτήσεις;"
            }
        ],
        options: [
            {
                text: "Ναιι 😅",
                code:"yes" 
            }, 
            {
                text : "Όχι 😕",
                code:"no"
            }
        ]
    },
    {
        orbContext: [
            {
                text:"Χαίρομαιιι",
                conditionCode:"yes"
            },
            {
                text:"Well, I don't care",
                conditionCode:"no"
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Γιατί ξερεις, αυτό το παιχνίδι είναι public.\nΘα ηταν κρίμα να το βλεπε όποιος να ναι",
            },
        ],
    },
        {
        orbContext: [
            {
                text:"(Όχι ότι όλο το concept είναι ένα παιχνίδι ερωτήσεων)",
            },
        ],
    },
    {
        showImage: true,
        orbContext: [
            {
                text:"Πάμε, ερώτηση πρώτη: Ξερεις μήπως αυτόν τον τύπο;",
            },
        ],
        options: [
            {
                text: "Ναι. Τον έχω πετύχει στο tinder νομίζω",
                code:"funny" 
            }, 
            {
                text : "You mean my cute and smart but also sexy boyfriend?",
                code:"yay"
            }
        ]
    },
    {
        orbContext: [
            {
                text:"Σε αυτή την απυλύτα ρομαντική στιγμή αποφάσισες να τρολλάρεις;\nΜάλιστα..",
                conditionCode:"funny"
            },
            {
                text:"Ουυυ παω στοίχημα πως ο βλάκας δίπλα σου χαμογελάει αυτή τη στιγμή.\nΓλειφτρώνι",
                conditionCode:"yay"
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Ερώτηση νο 2. Για ποιό από τα παρακάτω έχει ανασφάλειες ο δημιουργός αυτού του παιχνιδιού;",
            }
        ],
        options: [
            {
                text: "Την αραίωση",
                code:"hair" 
            }, 
            {
                text : "Κάτι Ισπανούς ηθοποιούς στην Κρήτη.",
                code:"spain"
            }
        ]
    },
    {
        orbContext: [
            {
                text:"Ding ding ding. Δεν έχει να κάνει με τον αν σε εμπιστεύεται ομως. Κάποιες φορές τον πιάνει το κτητικό του.",
                conditionCode:"spain"
            },
            {
                conditionCode:"hair",
                text:"Nope. Παρότι έχει όντως ανασφάλεια για τα μαλλιά του, νομίζω κερδίζει η κτητικότητα. Μάλλον επειδή την αραίωση είχε περισσότερο χρόνο να το επεξεργαστεί.",
            }
        ],
    },
        {
        orbContext: [
            {
                text:"Προχωράμε στην ερώτηση 3. Σε συμπαθεί λες ο δημιουργός αυτού του παιχνιδιού;",
            }
        ],
                options: [
            {
                text: "Ναι 🥰",
            }, 
            {
                text : "Οχι. 🥺",
                isMistake: true,
                failureText: "Ρε χαζό. Σε αγαπάει"
            }
        ]
    },
    {
        orbContext: [
            {
                text:"Πάμε λίγο:\nΣτη Σαλόνικα με Καπλάνη stay-at-home mum να σου μαγειρευει όσο είσαι μεγάλη ανεξαρτητη business woman \n ή\n Στον Αμπελώνα με σένα σπιτι και Καπλάνη μεγαλοκτηματία;"
            }
        ],
        options: [
            {
                text: "Το πρώτο.",
            }, 
            {
                text : "Το δεύτερο.",
            }
        ]
    },
    {
        orbContext: [
            {
                text:"Χαχαχαχ το γάμησα. Πάω στοίχημα πως έβαλες το πρώτο πάντως."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Κοίτα, για να μην αρχίσουμε να παίζουμε διλήμματα, κάτι στο οποίο είμαι επιρρεπής.."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Ήθελα να πω πως η ιδέα μου ήταν να σου γράψω κάτι για τα γενέθλια σου και να το κρατήσεις"
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Επειδή όμως έχω καιρό να εξασκήσω αυτό το σπόρ, σκέφτηκα να σου κάνω ένα μικρό παιχνίδι."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Οπότε θα στο πω κι από δω. Χρόνια πολλά Έλενα, να τα εκατοστήσεις"
            }
        ],
    },
    {
        orbContext: [
            {
                text:"(Ελπίζω να έχουν πάει όλα καλά μέχρι στιγμής, γιατί δεν υπάρχει περίπτωση να προλάβω να το τεστάρω όλο)"
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Έχω περάσει πολύ όμορφα τους τελευταίους μήνες.\nΕίσαι ένας εξαιρετικός άνθρωπος, πέρα από ικανή, έξυπνη, όμορφη."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Λατρεύω πόσο ανοιχτή είσαι στα καινούρια πράγματα."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Και σε αγαπάω (πέρα από το συμπαθώ)."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Ελπίζω τη νέα χρονιά να φτάσεις πιο κοντά στην Έλενα που θέλεις."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Αλλά μην ανησυχείς. Δεν είναι αυτό το δώρο σου."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Αρχικά άνοιξε την τσάντα μου, γιατί κάτι υπάρχει για σένα."
            }
        ],
    },
        {
        orbContext: [
            {
                text:"Επιιιισης σου έκλεισα ένα μασαζάκι να χαλαρώσεις (πριν μου πεις ότι ήθελες να πας)"
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Μετά από το οποίο να έρθεις σπιτι μου να σου μαγειρέψω"
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Γιεπ, μόνο αυτά θα συμβούν εκείνο το βράδυ."
            }
        ],
    },
    {
        orbContext: [
            {
                text:"Ελπίζω όλο αυτό να σου άρεσε. Σε αφήνω"
            }
        ],
    },
];